
# zshrc.d loading (from conf.d)
mattmc3/zshrc.d

# set up Zsh completions with plugins
#zsh-users/zsh-completions kind:fpath path:src

# zsh benchmarking
romkatv/zsh-bench kind:path

# abbr alternative to alias
#olets/zsh-abbr

# Alternative to using oh-my-zsh
#mattmc3/ez-compinit

# ==============================================================================
# oh-my-zsh plugins
# see https://github.com/ohmyzsh/ohmyzsh/blob/master/plugins
# =========================================

# frameworks like oh-my-zsh are supported
getantidote/use-omz        # handle OMZ dependencies
ohmyzsh/ohmyzsh path:lib   # load OMZ's library
# ohmyzsh/ohmyzsh path:lib/history.zsh # load OMZ's history library

# Now, let's pick our Oh My Zsh utilty plugins
#ohmyzsh/ohmyzsh path:plugins/magic-enter
# ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/copybuffer
ohmyzsh/ohmyzsh path:plugins/cp
ohmyzsh/ohmyzsh path:plugins/copyfile
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/extract
#ohmyzsh/ohmyzsh path:plugins/globalias
ohmyzsh/ohmyzsh path:plugins/fancy-ctrl-z
#ohmyzsh/ohmyzsh path:plugins/otp
ohmyzsh/ohmyzsh path:plugins/zoxide

# Add some programmer plugins
# ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/golang
#ohmyzsh/ohmyzsh path:plugins/python

# or lighter-weight ones like zsh-utils
#belak/zsh-utils path:editor
#belak/zsh-utils path:history
#belak/zsh-utils path:prompt
#belak/zsh-utils path:utility

# prompts:
#   with prompt plugins, remember to add this to your .zshrc:
#   `autoload -Uz promptinit && promptinit && prompt pure`
#sindresorhus/pure     kind:fpath
#romkatv/powerlevel10k kind:fpath

# popular fish-like plugins
mattmc3/zfunctions
zsh-users/zsh-completions path:src kind:fpath
zdharma-continuum/fast-syntax-highlighting kind:defer
#zsh-users/zsh-history-substring-search

# fish-like autosuggestions
zsh-users/zsh-autosuggestions
